In [1]:
D = 89000
N = 751000
DJ = 89000*100
NJ = 751000*20
print(DJ)
print(NJ)

8900000
15020000

In [2]:
total_dj = DJ * 0.95
total_nj = NJ * 0.9
print(total_dj)
print(total_nj)

8455000.0
13518000.0

In [3]:
myWeight = int(input("몸무게를 입력하세요(kg) :"))
myHeight = int(input("키를 입력하세요(m):"))
BMI = myWeight/(myHeight**2)

In [3]:
s = "Daum KaKao"
A = s[:4]
B = s[5:]
print(B + " " + A)

KaKao Daum

In [11]:
url = "C:\\myphoto\\helloworld.jpg"
folder = url[:10]
file = url[11:21]
ext = url[22:]

'jpg'

In [22]:
lista = [82,74,93,65,32,71,90,88,74]
lista.sort()
A = lista[-3:]
score = sum(A)/len(A)
print(score)

for i in range(len(lista)-1):
    for e in range(i+1, len(lista)):
        if lista[i] > lista[e]:
            lista[i], lista[e] == lista[e], lista[i]
print(lista)

90.33333333333333
[32, 65, 71, 74, 74, 82, 88, 90, 93]

In [24]:
my_age = int(input("나이를 입력하시오 : "))//10
print(f"나의 나이는 {my_age}0대입니다.")

나의 나이는 20대입니다.

In [27]:
myWeight = int(input("몸무게를 입력하세요(kg) :"))
myHeight = int(input("키를 입력하세요(m):"))
if myHeight < 151:
    stand = myHeight - 110
else:
    stand = (myHeight - 110) * 0.9
obesity = ((myWeight-stand)/stand)*100
if obesity < 21:
    print("정상")
elif obesity < 31:
    print("경도비만")
elif obesity < 41:
    print("중도비만")
else:
    print("고도비만")

중도비만

In [54]:
sum = 0
for i in range(0, 101, 2):
    sum += i
print(sum)

a = 0
while a < 101:
    sum += a
    a += 2
print(sum)

2550
5100

In [37]:
st = ['A','A','A','O','O','O','B','B','AB']
dicta = {}
for a in st:
    if a not in dicta.keys():
        dicta[a] = st.count(a)
print(dicta)

{'A': 3, 'O': 3, 'B': 2, 'AB': 1}

In [40]:
n = int(input("숫자를 입력하세요 :"))
A = 1
for a in range(1, n+1):
    A *= a
print(A)

def facto(n):
    if (n > 1):
        return n * facto(n - 1)
    else:
        return 1
a = int(input("숫자를 입력하세요 : "))
print(facto(a))

120
120

In [41]:
lista = []
for a in range(1, 6):
    for b in range(1, 6):
        if a+b == 6:
            lista.append(a)
            lista.append(b)
print(lista)

[1, 5, 2, 4, 3, 3, 4, 2, 5, 1]

In [47]:
x = int(input("숫자를 입력하세요 :"))
y = int(input("숫자를 입력하세요 :"))
a = 0
for i in range(1, 101):
    if i%x == 0 and i%y == 0:
        a += i
        break # 최소값을 구할 때
print(a)

30

In [48]:
mon = [4,3,3,4,5]
sun = [7,6]
a = 9500
b = 13000
num1 = 0
num2 = 0
for i in mon:
    num1 += i*a
for e in sun:
    num2 += i*b
print(num1+num2)

310500

In [1]:
item = [{"수량":291, "단가": 500},
        {"수량":586, "단가": 320},
        {"수량":460, "단가": 100},
        {"수량":558, "단가": 120},
        {"수량":18, "단가": 92},
        {"수량":72, "단가": 30},
        ]
total = 0
for a in item:
    total = a["수량"] * a["단가"] * 0.9
print(total)

for i in range(len(item)-1):
    for j in range(i, len(item)):
        if item[i]["단가"] < item[j]["단가"]:
            item[i], item[j] = item[j], item[i]
print(item)

1944.0
[{'수량': 291, '단가': 500}, {'수량': 586, '단가': 320}, {'수량': 558, '단가': 120}, {'수량': 460, '단가': 100}, {'수량': 18, '단가': 92}, {'수량': 72, '단가': 30}]

In [2]:
from pandas import read_excel
from pandas import Series
import numpy

In [3]:
df = read_excel("https://data.hossam.kr/pre_sample.xlsx", index_col="이름")
df

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80

In [4]:
df.shape

(9, 6)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, 철수 to 석영
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   학년      9 non-null      int64
 1   성별      9 non-null      object
 2   국어      9 non-null      int64
 3   영어      9 non-null      int64
 4   수학      9 non-null      int64
 5   과학      9 non-null      int64
dtypes: int64(5), object(1)
memory usage: 504.0+ bytes

In [6]:
df2 = df.astype({'국어': 'float', '영어': 'float', '수학': 'str', '과학': 'bool'})
df2

    학년  성별    국어     영어  수학    과학
이름
철수   1  남자  98.0   77.0  88  True
영희   2  여자  88.0  120.0  62  True
민철   1  남자  92.0   70.0  83  True
수현   3  여자  63.0   60.0  31  True
호영   4  남자  75.0   50.0  90  True
영호   4  남자  80.0   88.0  91  True
용식   2  남자  82.0   88.0  79  True
나영   1  여자  90.0   92.0  81  True
석영   1  남자  91.0   90.0  89  True

In [7]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, 철수 to 석영
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   학년      9 non-null      int64
 1   성별      9 non-null      object
 2   국어      9 non-null      float64
 3   영어      9 non-null      float64
 4   수학      9 non-null      object
 5   과학      9 non-null      bool
dtypes: bool(1), float64(2), int64(1), object(2)
memory usage: 441.0+ bytes

In [8]:
df2 = df.reindex(index=['석영', '호영', '민철', '수현'])
df2

    학년  성별  국어  영어  수학  과학
이름
석영   1  남자  91  90  89  80
호영   4  남자  75  50  90  88
민철   1  남자  92  70  83  79
수현   3  여자  63  60  31  71

In [9]:
df3 = df.rename(columns={'국어': 'kor', '영어': 'eng', '수학': 'math', '과학': 'sci'},
                index={'석영': 'suk', '호영': 'ho', '민철': 'min', '수현': 'su'})
df3

     학년  성별  kor  eng  math  sci
이름
철수    1  남자   98   77    88   64
영희    2  여자   88  120    62   72
min   1  남자   92   70    83   79
su    3  여자   63   60    31   71
ho    4  남자   75   50    90   88
영호    4  남자   80   88    91   72
용식    2  남자   82   88    79   90
나영    1  여자   90   92    81   95
suk   1  남자   91   90    89   80

In [10]:
df4 = df.sort_values('국어')
df4

    학년  성별  국어   영어  수학  과학
이름
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
영희   2  여자  88  120  62  72
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80
민철   1  남자  92   70  83  79
철수   1  남자  98   77  88  64

In [11]:
df5 = df.sort_values(['영어', '학년'])
df5

    학년  성별  국어   영어  수학  과학
이름
호영   4  남자  75   50  90  88
수현   3  여자  63   60  31  71
민철   1  남자  92   70  83  79
철수   1  남자  98   77  88  64
용식   2  남자  82   88  79  90
영호   4  남자  80   88  91  72
석영   1  남자  91   90  89  80
나영   1  여자  90   92  81  95
영희   2  여자  88  120  62  72

In [12]:
df7 = df.sort_index()
df7

    학년  성별  국어   영어  수학  과학
이름
나영   1  여자  90   92  81  95
민철   1  남자  92   70  83  79
석영   1  남자  91   90  89  80
수현   3  여자  63   60  31  71
영호   4  남자  80   88  91  72
영희   2  여자  88  120  62  72
용식   2  남자  82   88  79  90
철수   1  남자  98   77  88  64
호영   4  남자  75   50  90  88

In [13]:
r1 = df.query('국어 > 80')
r1

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80

In [14]:
r2 = df.query('국어 > 80 and 수학 > 80')
r2

    학년  성별  국어  영어  수학  과학
이름
철수   1  남자  98  77  88  64
민철   1  남자  92  70  83  79
나영   1  여자  90  92  81  95
석영   1  남자  91  90  89  80

In [15]:
r3 = df.query('국어 > 80 or 수학 > 80')
r3

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80

In [17]:
point = int(input('점수를 입력하세요 :'))
print("입력한 점수인 %d점 보다 높은 학생은 다음과 같습니다." % point)

r4 = df.query('국어 > @point')
r4

입력한 점수인 70점 보다 높은 학생은 다음과 같습니다.

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80

In [18]:
f1 = df.filter(['국어', '영어'])
f1

    국어   영어
이름
철수  98   77
영희  88  120
민철  92   70
수현  63   60
호영  75   50
영호  80   88
용식  82   88
나영  90   92
석영  91   90

In [19]:
df.loc['정호'] = [2, '남자', 90,80,70,60]
df

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80
정호   2  남자  90   80  70  60

In [20]:
df.loc['민정'] = {'성별': '여자', '학년': 4, '국어': 81, '영어': 72, '수학': 84, '과학': 90}
df

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80
정호   2  남자  90   80  70  60
민정   4  여자  81   72  84  90

In [21]:
s = Series([2, '남자', 90,80,70,60], index=['학년', '성별', '국어', '영어', '수학', '과학'])
df.loc['형석'] = s
df

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80
정호   2  남자  90   80  70  60
민정   4  여자  81   72  84  90
형석   2  남자  90   80  70  60

In [22]:
s = Series([2, '남자', 93, 71, 68], index=['학년', '성별', '국어', '수학', '과학'])
df.loc['석호'] = s
df

    학년  성별  국어     영어  수학  과학
이름
철수   1  남자  98   77.0  88  64
영희   2  여자  88  120.0  62  72
민철   1  남자  92   70.0  83  79
수현   3  여자  63   60.0  31  71
호영   4  남자  75   50.0  90  88
영호   4  남자  80   88.0  91  72
용식   2  남자  82   88.0  79  90
나영   1  여자  90   92.0  81  95
석영   1  남자  91   90.0  89  80
정호   2  남자  90   80.0  70  60
민정   4  여자  81   72.0  84  90
형석   2  남자  90   80.0  70  60
석호   2  남자  93    NaN  71  68

In [23]:
df.loc['철민'] = df.loc['철수']
df

    학년  성별  국어     영어  수학  과학
이름
철수   1  남자  98   77.0  88  64
영희   2  여자  88  120.0  62  72
민철   1  남자  92   70.0  83  79
수현   3  여자  63   60.0  31  71
호영   4  남자  75   50.0  90  88
영호   4  남자  80   88.0  91  72
용식   2  남자  82   88.0  79  90
나영   1  여자  90   92.0  81  95
석영   1  남자  91   90.0  89  80
정호   2  남자  90   80.0  70  60
민정   4  여자  81   72.0  84  90
형석   2  남자  90   80.0  70  60
석호   2  남자  93    NaN  71  68
철민   1  남자  98   77.0  88  64

In [24]:
k1 = df.drop('철민')
k1

    학년  성별  국어     영어  수학  과학
이름
철수   1  남자  98   77.0  88  64
영희   2  여자  88  120.0  62  72
민철   1  남자  92   70.0  83  79
수현   3  여자  63   60.0  31  71
호영   4  남자  75   50.0  90  88
영호   4  남자  80   88.0  91  72
용식   2  남자  82   88.0  79  90
나영   1  여자  90   92.0  81  95
석영   1  남자  91   90.0  89  80
정호   2  남자  90   80.0  70  60
민정   4  여자  81   72.0  84  90
형석   2  남자  90   80.0  70  60
석호   2  남자  93    NaN  71  68

In [25]:
k2 = df.drop(['석영', '정호', '민정', '형석'])
k2

    학년  성별  국어     영어  수학  과학
이름
철수   1  남자  98   77.0  88  64
영희   2  여자  88  120.0  62  72
민철   1  남자  92   70.0  83  79
수현   3  여자  63   60.0  31  71
호영   4  남자  75   50.0  90  88
영호   4  남자  80   88.0  91  72
용식   2  남자  82   88.0  79  90
나영   1  여자  90   92.0  81  95
석호   2  남자  93    NaN  71  68
철민   1  남자  98   77.0  88  64

In [26]:
k3 = df.drop(df.index[0])
k3

    학년  성별  국어     영어  수학  과학
이름
영희   2  여자  88  120.0  62  72
민철   1  남자  92   70.0  83  79
수현   3  여자  63   60.0  31  71
호영   4  남자  75   50.0  90  88
영호   4  남자  80   88.0  91  72
용식   2  남자  82   88.0  79  90
나영   1  여자  90   92.0  81  95
석영   1  남자  91   90.0  89  80
정호   2  남자  90   80.0  70  60
민정   4  여자  81   72.0  84  90
형석   2  남자  90   80.0  70  60
석호   2  남자  93    NaN  71  68
철민   1  남자  98   77.0  88  64

In [27]:
k4 = df.drop(df.index[0:10])
k4

    학년  성별  국어    영어  수학  과학
이름
민정   4  여자  81  72.0  84  90
형석   2  남자  90  80.0  70  60
석호   2  남자  93   NaN  71  68
철민   1  남자  98  77.0  88  64

In [28]:
k4['한국사'] = [72,56,90,88]
k4

    학년  성별  국어    영어  수학  과학  한국사
이름
민정   4  여자  81  72.0  84  90   72
형석   2  남자  90  80.0  70  60   56
석호   2  남자  93   NaN  71  68   90
철민   1  남자  98  77.0  88  64   88

In [29]:
k4['세계사'] = {"민정": 90, "형석": 88, "석호": 72, "철민": 56}
k4

    학년  성별  국어    영어  수학  과학  한국사  세계사
이름
민정   4  여자  81  72.0  84  90   72   90
형석   2  남자  90  80.0  70  60   56   88
석호   2  남자  93   NaN  71  68   90   72
철민   1  남자  98  77.0  88  64   88   56

In [30]:
s = Series([72,56,90,88], index=['석호', '철민', '민정', '형석'])
k4['윤리'] = s
k4

    학년  성별  국어    영어  수학  과학  한국사  세계사  윤리
이름
민정   4  여자  81  72.0  84  90   72   90  90
형석   2  남자  90  80.0  70  60   56   88  88
석호   2  남자  93   NaN  71  68   90   72  72
철민   1  남자  98  77.0  88  64   88   56  56

In [31]:
k4['체육'] = 100
k4

    학년  성별  국어    영어  수학  과학  한국사  세계사  윤리   체육
이름
민정   4  여자  81  72.0  84  90   72   90  90  100
형석   2  남자  90  80.0  70  60   56   88  88  100
석호   2  남자  93   NaN  71  68   90   72  72  100
철민   1  남자  98  77.0  88  64   88   56  56  100

In [32]:
from pandas import DataFrame, read_excel
from pandas import merge, concat, pivot_table, crosstab

In [33]:
고객 = read_excel("https://data.hossam.kr/customer.xlsx")
고객

   고객번호   이름
0  1001   둘리
1  1002  도우너
2  1003   또치
3  1004   길동
4  1005   희동
5  1006  마이콜
6  1007   영희

In [34]:
매출 = read_excel('https://data.hossam.kr/money.xlsx')
매출

   고객번호      금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001   30000

In [35]:
merge(고객, 매출)

   고객번호   이름     금액
0  1001   둘리  10000
1  1001   둘리  20000
2  1001   둘리  30000
3  1005   희동  15000
4  1006  마이콜   5000

In [36]:
merge(고객, 매출, how='left')

   고객번호   이름       금액
0  1001   둘리  10000.0
1  1001   둘리  20000.0
2  1001   둘리  30000.0
3  1002  도우너      NaN
4  1003   또치      NaN
5  1004   길동      NaN
6  1005   희동  15000.0
7  1006  마이콜   5000.0
8  1007   영희      NaN

In [37]:
merge(고객, 매출, how='right')

   고객번호   이름      금액
0  1001   둘리   10000
1  1001   둘리   20000
2  1005   희동   15000
3  1006  마이콜    5000
4  1008  NaN  100000
5  1001   둘리   30000

In [38]:
merge(고객, 매출, how='outer')

   고객번호   이름        금액
0  1001   둘리   10000.0
1  1001   둘리   20000.0
2  1001   둘리   30000.0
3  1002  도우너       NaN
4  1003   또치       NaN
5  1004   길동       NaN
6  1005   희동   15000.0
7  1006  마이콜    5000.0
8  1007   영희       NaN
9  1008  NaN  100000.0

In [39]:
df_left = read_excel("https://data.hossam.kr/merge_left2.xlsx")
df_left

  고객명          날짜     데이터
0  민수  2018-01-01   20000
1  수영  2018-01-01  100000

In [40]:
df_right = read_excel("https://data.hossam.kr/merge_right2.xlsx")
df_right

  고객명  데이터
0  민수  21세
1  수영  20세

In [41]:
tmp = merge(df_left, df_right, on='고객명')
tmp

  고객명          날짜   데이터_x 데이터_y
0  민수  2018-01-01   20000   21세
1  수영  2018-01-01  100000   20세

In [46]:
tmp.rename(columns={'데이터_x':'금액', '데이터_y':'나이'})

  고객명          날짜      금액   나이
0  민수  2018-01-01   20000  21세
1  수영  2018-01-01  100000  20세